---
kind: property
id: P:Autodesk.Revit.DB.IViewSheetSet.ViewOrganizationId
source: html/cab190d0-c36b-4bdb-1259-93241c94fd58.htm
---
# Autodesk.Revit.DB.IViewSheetSet.ViewOrganizationId Property

ElementId to the BrowserOrganization for non-sheet views.

## Syntax (C#)
```csharp
ElementId ViewOrganizationId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - Thrown when the ElementId does not reference to BrowserOrganization , or the target type of BrowserOrganization is incompatible.